In [1]:
import pandas as pd

In [5]:
account = {
    "first_name": ["Ayush", "Ryan", "Chisato", "Isabelle"],
    "last_name": ["Adhikari", "Griffin", "Nii", "Bui"],
    "University": ["CSU", "CSU", "CSU", "DU"],
    "Major": ["CIS", "CS", "Piano", "Nutrition"]
}

In [6]:
account["first_name"]

['Ayush', 'Ryan', 'Chisato', 'Isabelle']

In [8]:
df = pd.DataFrame(account)

In [9]:
df

  first_name last_name University      Major
0      Ayush  Adhikari        CSU        CIS
1       Ryan   Griffin        CSU         CS
2    Chisato       Nii        CSU      Piano
3   Isabelle       Bui         DU  Nutrition

In [10]:
df["first_name"]

0       Ayush
1        Ryan
2     Chisato
3    Isabelle
Name: first_name, dtype: object

In [12]:
type(df["first_name"])

pandas.core.series.Series

In [13]:
df.first_name

0       Ayush
1        Ryan
2     Chisato
3    Isabelle
Name: first_name, dtype: object

In [15]:
df.last_name

0    Adhikari
1     Griffin
2         Nii
3         Bui
Name: last_name, dtype: object

In [17]:
df[["first_name", "last_name"]]

  first_name last_name
0      Ayush  Adhikari
1       Ryan   Griffin
2    Chisato       Nii
3   Isabelle       Bui

In [18]:
df.columns

Index(['first_name', 'last_name', 'University', 'Major'], dtype='object')

In [19]:
df.loc(1)

In [22]:
df.loc[0]

first_name       Ayush
last_name     Adhikari
University         CSU
Major              CIS
Name: 0, dtype: object

In [23]:
df.loc[[0,1,2]]

  first_name last_name University  Major
0      Ayush  Adhikari        CSU    CIS
1       Ryan   Griffin        CSU     CS
2    Chisato       Nii        CSU  Piano

In [26]:
df.loc[[0,1],["first_name", "last_name"]]

  first_name last_name
0      Ayush  Adhikari
1       Ryan   Griffin

In [28]:
df.iloc[[0,1,2],[0,1]]

  first_name last_name
0      Ayush  Adhikari
1       Ryan   Griffin
2    Chisato       Nii